index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Welcome to emacs</title>
<meta name="author" content="(Jason Evans)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/black.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Welcome to emacs</h1><h2 class="author">Jason Evans</h2><p class="date">Created: 2017-02-03 Fri 09:51</p>
</section>
<section id="table-of-contents">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-org3aab09c">Clean Coder</a>
<ul>
<li><a href="#/slide-org53a3945">Covering</a></li>
<li><a href="#/slide-org31cecef">Doing</a>
<ul>
<li><a href="#/slide-org3a86e10">Prepardeness (Ch 4)</a></li>
<li><a href="#/slide-org2d3a7cd">Isolation</a></li>
</ul>
</li>
<li><a href="#/slide-org27cf3fb">Use your energy and focus wisely</a></li>
<li><a href="#/slide-orgcd844ec">Time Management</a>
<ul>
<li><a href="#/slide-org4e20cf9">Resources:</a></li>
</ul>
</li>
<li><a href="#/slide-org5363350">Teamwork, Communication, and Collaboration</a></li>
<li><a href="#/slide-org1d3fed1">Mentoring, Apprenticeship, and Craftmanship</a>
<ul>
<li><a href="#/slide-orgc9a0b35">Practice</a></li>
<li><a href="#/slide-org0d6b753">Craftmanship</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
</section>
<section>
<section id="slide-org3aab09c">
<h2 id="org3aab09c">Clean Coder</h2>
<div class="outline-text-2" id="text-org3aab09c">
</div></section>
<section id="slide-org53a3945">
<h3 id="org53a3945">Covering</h3>
<ul>
<li>Chapter 4  : Coding</li>
<li>Chapter 9  : Time Management</li>
<li>Chapter 6  : Practicing</li>
<li>Chapter 12 : Collaboration</li>
<li>Chapter 13 : Teams and Projects</li>
<li>Chapter 14 : Mentoring, Apprenticeship, and Craftmanship</li>

</ul>
</section>
<section id="slide-org31cecef">
<h3 id="org31cecef">Doing</h3>
<div class="outline-text-3" id="text-org31cecef">
</div></section>
<section id="slide-org3a86e10">
<h4 id="org3a86e10">Prepardeness (Ch 4)</h4>
<ul>
<li>As developers what should our goals be:
<ul>
<li class="fragment roll-in">First: your code must work</li>
<li class="fragment roll-in">Your code must: solve the problem</li>
<li class="fragment roll-in">Your code must: fit into the current system</li>
<li class="fragment roll-in">Your code must: be readable by other developers</li>

</ul></li>

</ul>
</section>
<section id="slide-org2d3a7cd">
<h4 id="org2d3a7cd">Isolation</h4>
<ul>
<li>The Zone</li>
<li>Music</li>

</ul>
<ul class="org-ul"><li><a id="orgcefc4d0"></a>Resources<br  /><ul>
<li>Flow, Mihály Csíkszentmihály</li>
<li>Deep Work: Rules for Focused Success in a Distracted World, Cal Newport</li>

</ul></li></ul>
</section>
<section id="slide-org27cf3fb">
<h3 id="org27cf3fb">Use your energy and focus wisely</h3>
<p>
Software development is a profession which relies heavily on focus. While we may get to sit in a chair all day, we use a lof of energy. 
</p>
<ul>
<li>Avoid the 3 AM Code (Ch. 4), avoid over working</li>
<li>Worrysome code (Ch. 4),</li>
<li>Pacing yourself (Ch. 4)</li>
<li>Recharging (Ch.9)</li>

</ul>
</section>
<section id="slide-orgcd844ec">
<h3 id="orgcd844ec">Time Management</h3>
<ul>
<li>Understanding the value of your time
<ul>
<li>The cost of meetings</li>
<li>Overtime and overcommiting and under performing</li>

</ul></li>

</ul>
</section>
<section id="slide-org4e20cf9">
<h4 id="org4e20cf9">Resources:</h4>
<ul>
<li>Getting Things Done (GTD), David Allen (Book)</li>
<li>Promodoro Technique</li>
<li>EMACS &#x2026;.. orgmode</li>

</ul>
</section>
<section id="slide-org5363350">
<h3 id="org5363350">Teamwork, Communication, and Collaboration</h3>
<ul>
<li>Pairing</li>
<li>Team members have a responsibility to other team members</li>

</ul>
<ul class="org-ul"><li><a id="orgceff728"></a>Resources:<br  /><ul>
<li>Team Geek, Brian W. Fitzpatrick, Ben Collins-Sussman</li>

</ul></li></ul>
</section>
<section id="slide-org1d3fed1">
<h3 id="org1d3fed1">Mentoring, Apprenticeship, and Craftmanship</h3>
<div class="outline-text-3" id="text-org1d3fed1">
</div></section>
<section id="slide-orgc9a0b35">
<h4 id="orgc9a0b35">Practice</h4>
<div class="outline-text-4" id="text-orgc9a0b35">
</div><ul class="org-ul"><li><a id="org22e7c6e"></a>Resources:<br  /><ul>
<li>Codewars, <a href="https://www.codewars.com/">https://www.codewars.com/</a></li>
<li>Project Euler, <a href="https://projecteuler.net/">https://projecteuler.net/</a></li>
<li>Kaggle, <a href="https://www.kaggle.com/">https://www.kaggle.com/</a> (Data science competitions)</li>
<li>The Pragmatic Programmer series of books.</li>

</ul></li></ul>
</section>
<section id="slide-org0d6b753">
<h4 id="org0d6b753">Craftmanship</h4>
<div class="outline-text-4" id="text-org0d6b753">
</div><ul class="org-ul"><li><a id="org43a031c"></a>Resources:<br  /><ul>
<li>Clean Coder, Bob Martin (Book / Video Collection)</li>
<li></li>

</ul></li></ul>
</section>
</section>
</div>
</div>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/head.min.js"></script>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
